Revit 2024 API
MEPHiddenLineSettings.OutsideGap Property
 The gap for the lines that appear external to the crossing segments.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public double OutsideGap { get; set; }
Visual Basic
Public Property OutsideGap As Double
	Get
	Set
Visual C++
public:
property double OutsideGap {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The gap size must be between 0" and 3/4".
See Also
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace